### CONCATENACION, NORMALIZACION Y CONSULTAS

1. Se cargan los nuevos datos limpios
2. Se genera un nuevo EDA para normalizar las columnas
3. Se se realizan las consultas necesarias

In [1]:
import pandas as pd
import numpy as np
import pymysql
import requests
import io
import sqlalchemy as sql
from sqlalchemy import create_engine
import time
import seaborn as sea
from pandas_profiling import ProfileReport 
import json
from pandas import json_normalize

In [3]:
# ruta de los datasets
dataset1 = pd.read_csv(r'D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_amazon_clean.csv', sep = ',', encoding = 'utf_8')
dataset2 = pd.read_csv(r'D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_disney_clean.csv', sep = ',', encoding = 'utf_8')
dataset3 = pd.read_csv(r'D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_hulu_clean.csv', sep = ',', encoding = 'utf_8')
dataset4 = pd.read_csv(r'D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_netflix_clean.csv', sep = ',', encoding = 'utf_8')

In [ ]:
dataset3.head(10)

In [4]:
frames = [dataset1, dataset2, dataset3, dataset4]
dataset_new= pd.concat(frames)
dataset_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22998 entries, 0 to 8806
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       22998 non-null  object
 1   type          22998 non-null  object
 2   title         22998 non-null  object
 3   cast          22998 non-null  object
 4   release_year  22998 non-null  int64
 5   duration      22998 non-null  object
 6   listed_in     22998 non-null  object
 7   description   22998 non-null  object
 8   platform      22998 non-null  object
 9   min           22998 non-null  int64
 10  season        22998 non-null  object
dtypes: int64(2), object(9)
memory usage: 2.1+ MB

In [139]:
dataset_new.tail(5)

,show_id,type,title,cast,release_year,duration,listed_in,description,platform,min,season
22993,s8803,Movie,Zodiac,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",2007,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a...",netflix,158,min
22994,s8804,TV Show,Zombie Dumb,sin dato,2018,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g...",netflix,2,Seasons
22995,s8805,Movie,Zombieland,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",2009,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...,netflix,88,min
22996,s8806,Movie,Zoom,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",2006,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero...",netflix,88,min
22997,s8807,Movie,Zubaan,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",2015,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...,netflix,111,min

In [5]:
# Procedemos a guardar los datos limpios concatenados concat() en la carpeta DATA_CLEAN
dataset_new.to_csv(r'D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_new.csv', index = False)

### CARGAR DATOS A SQL WORKBENCH PARA NORMALIZAR LAS COLUMNAS

In [6]:
dataset_new = pd.read_csv(r"D:\Python\PROYECTO_1_DATA_ENGINEER\DATASET_CLEAN\dataset_new.csv", sep=',', encoding='UTF-8')
dataset_new.columns

Index(['show_id', 'type', 'title', 'cast', 'release_year', 'duration',
       'listed_in', 'description', 'platform', 'min', 'season'],
      dtype='object')

In [88]:
dataset_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22998 entries, 0 to 22997
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       22998 non-null  object
 1   type          22998 non-null  object
 2   title         22998 non-null  object
 3   cast          22998 non-null  object
 4   release_year  22998 non-null  int64
 5   duration      22998 non-null  object
 6   listed_in     22998 non-null  object
 7   description   22998 non-null  object
 8   platform      22998 non-null  object
 9   min           22998 non-null  int64
 10  season        22998 non-null  object
dtypes: int64(2), object(9)
memory usage: 1.9+ MB

In [37]:
dataset_new = dataset_new.drop(['description'], axis=1)

In [ ]:
dataset_new['duration'] = dataset_new['duration'].replace('min','') # con el metodo replace podemos reemplazar caracteres

In [119]:
# La columna (min) de tipo string(str) se convierte a entero(int)
dataset_new['min'] = pd.to_numeric(dataset_new['min'])

In [133]:
dataset_new.dtypes

show_id         object
type            object
title           object
cast            object
release_year     int64
duration        object
listed_in       object
description     object
platform        object
min              int64
season          object
dtype: object

In [7]:
connect_info = 'mysql+pymysql://root:Haad91280567#@localhost:3306/etl_pindividual1?charset=utf8'
engine = create_engine(connect_info)

In [47]:
dataset_new.to_sql(name = 'dataset_new',   # Nombre de la tabla en la BD
           con = engine,
           if_exists = 'append',
           index = False,
           dtype = {'show_id': sql.VARCHAR(100),
                    'type': sql.VARCHAR(200),
                    'title': sql.VARCHAR(200),
                    'cast': sql.VARCHAR(2048),
                    'release_year': sql.INT(),
                    'duration': sql.VARCHAR(200),
                    'listed_in': sql.VARCHAR(200),
                    'platform': sql.VARCHAR(100),
                    'min': sql.INT(),
                    'season': sql.VARCHAR(100)
                    
                                       
                    }
           )

22998

In [11]:
engine = sql.create_engine("sqlite:///BaseDatos/dataset_new.db")
dataset_new.to_sql(name="dataset_new", con=engine, if_exists = "replace")

22998

### 3. PROCEDIMIENTO DE CONSULTA DE DATOS

In [134]:
filtro = dataset_new[dataset_new['title'].str.contains("the House That Jack Built", case = False)]
filtro

,show_id,type,title,cast,release_year,duration,listed_in,description,platform,min,season
12660,s1543,Movie,The House That Jack Built,sin dato,2018,151 min,"Crime, Drama, Horror",Jack is a serial killer who views each murder ...,hulu,151,min

In [135]:
# Aqui se crea una consulta con las condiciones y parametros que solicitan
consulta1 = (dataset_new['platform'] == 'hulu') & (dataset_new['release_year'] == 2018) & (dataset_new['type'] == 'Movie')
consulta1.iloc[12660]

True

In [136]:
#1 Se crea un filtro de la consulta1 y se obtiene un resultado
filtro = dataset_new[consulta1]['min'].idxmax() 
dataset_new.loc[filtro, 'title']

'The House That Jack Built'

In [150]:
consulta2 = (dataset_new['type']=='Movie').groupby(dataset_new['platform']).count().sort_values(ascending=False)
print(consulta2)

platform
amazon     9668
netflix    8807
hulu       3073
disney     1450
Name: type, dtype: int64

In [165]:
#2 se crea una lista vacia, para luego de consultar la solicitud guardarla
lista = []
consulta2 = (dataset_new['type']=='Movie')&(dataset_new['platform']=='netflix')
lista.append(dataset_new[consulta2]['show_id'].count())
consulta3 = (dataset_new['type']=='TV Show')&(dataset_new['platform']=='netflix')
lista.append(dataset_new[consulta3]['show_id'].count())
print('plataforma Netflix', lista)

plataforma Netflix [6131, 2676]

In [148]:
consulta3 = (dataset_new['type']=='TV Show').groupby(dataset_new['platform']).count().sort_values(ascending=False)

platform
amazon     9668
netflix    8807
hulu       3073
disney     1450
Name: type, dtype: int64

In [176]:
# 3
consulta4 = (dataset_new['listed_in'].str.contains('Comedy'))
grupo = dataset_new[consulta4].groupby('platform')['listed_in'].count()
print(grupo)

platform
amazon     2099
disney      526
hulu        667
netflix     399
Name: listed_in, dtype: int64

In [211]:
consulta12 = (dataset_new['platform'] == 'netflix') & (dataset_new['release_year'] == 2018) 
grupo = dataset_new[consulta12].groupby('platform')['cast'].count()
print(grupo)

#dataset_new.loc([dataset_new.cast.value_counts()]['cast'])

platform
netflix    1147
Name: cast, dtype: int64

In [210]:
lista1 = []
consulta2 = (dataset_new['release_year']==2018)&(dataset_new['platform']=='netflix')
lista1.append(dataset_new[consulta2]['cast'].mode())

#consulta3 = (dataset_new['type']=='TV Show')&(dataset_new['platform']=='netflix')
#lista.append(dataset_new[consulta3]['show_id'].count())
print('plataforma Netflix', lista1)

plataforma Netflix [0    sin dato
Name: cast, dtype: object]

In [ ]:
print(titanic[['Age','Survived']].groupby(['Age']).mean().sort_values(by='Survived', ascending=False))

In [ ]:
# 4
plataforma = "netflix"
año = 2018

filtro = (df_total['platform'] == plataforma) & (df_total['release_year']== año)

df_cast = df_total[filtro]["cast"].str.split(pat=",", expand=True)

df_cast = pd.concat(
    objs=[df_cast[i] for i in range(len(df_cast.columns))], ignore_index=True
)
df_cast.value_counts()

In [73]:
dataset_new['title'].isin(['Global Meltdown']).any()

True

In [ ]:
filtro1 = dataset_new[dataset_new['release_year'] == 2008]
filtro

In [ ]:
filtro2 = dataset_new[dataset_new.release_year.isin([2008, 2009])]
filtro2.head(5)

In [ ]:
cuenta = dataset_new['min'].idmax()
cuenta

In [ ]:
dataset_new.iloc[dataset_new['title'] == 'Movie']

In [84]:
dataset_new.loc[(dataset_new.release_year == '2018') & (dataset_new['min'] == cuenta)]

Empty DataFrame
Columns: [show_id, type, title, cast, release_year, duration, listed_in, description, platform, min, season]
Index: []

In [82]:

filtro3 = dataset_new[(dataset_new['release_year']=='2018') & (dataset_new['min'] == cuenta)]
filtro3

Empty DataFrame
Columns: [show_id, type, title, cast, release_year, duration, listed_in, description, platform, min, season]
Index: []

In [ ]:
pd.read_sql('SELECT * FROM dataset_new where platform = "hulu" ', engine)